package ru.fafurin.lesson1;
// Урок 1. Docker

public class Main {
// 1-2. Что такое Docker? Для чего он используется?
    // Ответ: Docker - технология контейнеризации, предназначенная для автоматизации разработки, доставки и эксплуатации приложений
    // С помощью Docker можно создать изолированную среду разработки из различных технологий,
    // которую может использовать каждый член команды разработчиков и тестировщиков.

// 3. Есть и у него альтернативы?
    // LXC, OpenVz, Podman, Minikube, ...
}